<a href="https://colab.research.google.com/github/Lin777/PythonAndOtherTools/blob/master/Pandas/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

(Todo el material se basa en el contenido de este repositorio en github: https://github.com/adeshpande3/Pandas-Tutorial/blob/master/Pandas%20Tutorial.ipynb y en el contenido de esta pagina: https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#)

Pandas es una biblioteca de codigo abierto con licencia **BSD** que proporciona estructuras de datos dealto rendimiento y faciles de usar,y herramientas de analisis de datos para el lenguaje de programacion Python.

Pandas es un proyecto patrocinado por **NumFOCUS**

Importamos la biblioteca como a continuacion:

In [1]:
from  __future__ import print_function

import pandas as pd
import numpy as np
pd.__version__

'1.1.5'

## 1. Creacion de objetos

Las estructuras de datos principales en pandas estan implementadas en dos clases:

* **DataFrame**, que puedes imaginar como una tabla de datos relacional, con filas y columnas con nombre
* **Series**, que es una columna simple. Una clase DataFrame incluye una o mas Series y un nombre para cada Serie.

El marco de datos es una abstracction que se usa normalmente para manipular datos. Hay implementaciones similares en Spark y R.

### Series

Una manera de crear Series es contruir un objeto de Series. Por ejemplo:

In [2]:
pd.Series(['Bolivia', 'Peru', np.nan, 'Paraguay'])

0     Bolivia
1        Peru
2         NaN
3    Paraguay
dtype: object

### DataFrame

Estos objetos pueden crearse al enviar un Dict que asigne nombres de columnas de string a sus Series correspondientes. Si las Series no coinciden con la longitud, los valores que faltes se completan con valores NA/NaN.

Ejemplo:

In [3]:
dates = pd.date_range("20210101", periods=6)
dates

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
# Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2021-01-01 -1.271798  0.012564 -0.720289  0.245973
2021-01-02  1.096065  1.074642  0.175375  0.752752
2021-01-03  0.342935 -0.570162 -0.477419  0.574960
2021-01-04 -0.039649  0.054296 -0.140324 -1.454627
2021-01-05  0.836766 -0.691782 -0.578704 -1.098799
2021-01-06  1.053084  0.443680 -1.160485 -1.001153

In [5]:
# Creating a DataFrame by passing a dict of objects that can be converted to series-like
df2 = pd.DataFrame({"A": 1.0,
                    "B": pd.Timestamp("20130102"),
                    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
                    "D": np.array([3] * 4, dtype="int32"),
                    "E": pd.Categorical(["test", "train", "test", "train"]),
                    "F": "foo",})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

The columns of the resulting DataFrame have different dtypes.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## 2. Loading Data

I love cats, so I will use a dataset of cats (You can download this datasets here: https://data.gov.au/data/dataset?tags=cats)

I will use two datasets:

**Registered cats - Greater Dandenong**
  * Locality
  * Post code
  * Animal type
  * Primary breed
  * Primary colour
  * Gender

**Registered dogs and cats - Ballarat**
  * Age
  * Animal name
  * Breed
  * Colour
  * Postcode
  * Suburb
  * Type (Cat or Dog)
  * Registered

In [9]:
# Mount Google Drive
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [10]:
# read csv with pandas
df_cats = pd.read_csv('gdrive/My Drive/ColabData/Pandas/registered_cats.csv')

In [11]:
# read csv with pandas
df_cats_dogs = pd.read_csv('gdrive/My Drive/ColabData/Pandas/registered_cats_and_dogs.csv' , encoding='latin-1')

## 3. The basics

### Head and Tail

We can use the function head() to see the first couple rows of the dataframe (or the function tail() to see the last few rows).

In [12]:
df_cats.head()

          Locality  Postcode  ... Colour_Description GENDER
0  DANDENONG NORTH      3175  ...                TAB      F
1  DANDENONG NORTH      3175  ...             BLAWHI      M
2        DANDENONG      3175  ...             TABWHI      F
3       SPRINGVALE      3171  ...             TORWHI      F
4        DANDENONG      3175  ...             WHIGRE      M

[5 rows x 6 columns]

In [13]:
df_cats.tail()

        Locality  Postcode  ... Colour_Description GENDER
3480  SPRINGVALE      3171  ...               SEAL      M
3481  NOBLE PARK      3174  ...              BLACK      F
3482  NOBLE PARK      3174  ...             WHIGIN      M
3483  SPRINGVALE      3171  ...              BLUEP      M
3484  SPRINGVALE      3171  ...             GINGER      M

[5 rows x 6 columns]

### Shape

We can see the dimensions of the dataframe using the the shape attribute

In [14]:
print(df_cats.shape)
print(df_cats_dogs.shape)

(3485, 6)
(22249, 8)

### Columns

We can also extract all the column names as a list, by using the columns attribute and can extract the rows with the index attribute

In [15]:
df_cats.columns.tolist()

['Locality',
 'Postcode',
 'Animal_Type',
 'Breed_Description',
 'Colour_Description',
 'GENDER']

In [16]:
df_cats_dogs.columns.tolist()

['age',
 'animal_name',
 'breed',
 'colour',
 'postcode',
 'suburb',
 'type',
 'registered']

### Describe

In order to get a better idea of the type of data that we are dealing with, we can call the describe() function to see statistics like mean, min, etc about each column of the dataset.

In [17]:
df_cats.describe() # it only show the value of "Postcode column because it is the unique column with number values"

          Postcode
count  3485.000000
mean   3173.968723
std      13.633441
min    3171.000000
25%    3173.000000
50%    3174.000000
75%    3175.000000
max    3975.000000

### Max

The function max() will show you the maximum values of all columns

In [18]:
df_cats.max()

Locality       SPRINGVALE SOUTH
Postcode                   3975
Animal_Type                 Cat
GENDER                        U
dtype: object

In [19]:
# get max value for a particular column
df_cats['Postcode'].max()

3975

### Mean

In [20]:
# get median value for a particular column
df_cats['Postcode'].mean()

3173.9687230989957

### Argmax

We can call the argmax() function to identify the row index

In [21]:
df_cats['Postcode'].argmax()

1267

### Value_counts

 It shows how many times each item appears in the column. This particular command shows the number of games in each season

In [22]:
# amount of 
df_cats['Postcode'].argmax()

1267

### Dataframe as list

Each dataframe has a values attribute which is useful because it basically displays your dataframe in a numpy array style format

In [43]:
df_cats.values

array([['DANDENONG NORTH', 3175, 'Cat', 'DOMSH', 'TAB', 'F'],
       ['DANDENONG NORTH', 3175, 'Cat', 'DOMLH', 'BLAWHI', 'M'],
       ['DANDENONG', 3175, 'Cat', 'DOMSH', 'TABWHI', 'F'],
       ...,
       ['NOBLE PARK', 3174, 'Cat', 'DOMM', 'WHIGIN', 'M'],
       ['SPRINGVALE', 3171, 'Cat', 'RAGX', 'BLUEP', 'M'],
       ['SPRINGVALE', 3171, 'Cat', 'DOMSH', 'GINGER', 'M']], dtype=object)

Now, you can simply just access elements like you would in an array.

In [44]:
df_cats.values[0][0]

'DANDENONG NORTH'

## 4. Acessing Values

### Accessing columns

Exist two ways to access columns

In [52]:
# using brackets
df_cats['GENDER'].head()

0    F
1    M
2    F
3    F
4    M
Name: GENDER, dtype: object

In [53]:
# usign point access
df_cats.GENDER.head()

0    F
1    M
2    F
3    F
4    M
Name: GENDER, dtype: object

In [54]:
# multiple columns
df_cats[['Locality', 'GENDER']].head()

          Locality GENDER
0  DANDENONG NORTH      F
1  DANDENONG NORTH      M
2        DANDENONG      F
3       SPRINGVALE      F
4        DANDENONG      M

### Iloc

Ilon is definitely one of the more important functions. The main idea is that you want to use it whenever you have the integer index of a certain row that you want to access. As per Pandas documentation, iloc is an "integer-location based indexing for selection by position."

In [24]:
# select the max postcode value of df_cats dataframe

df_cats.iloc[[df_cats['Postcode'].argmax()]]

       Locality  Postcode  ... Colour_Description GENDER
1267  LYNDHURST      3975  ...             TABWHI      M

[1 rows x 6 columns]

Let's take this a step further. Let's say you want to know the locality of the biggest postcode value

In [25]:
# select locality of filter
df_cats.iloc[[df_cats['Postcode'].argmax()]]['Locality']

1267    LYNDHURST
Name: Locality, dtype: object


When you want to access values in a Series, you'll want to just treat the Series like a Python dictionary, so you'd access the value according to its key (which is normally an integer index)

In [26]:
df_cats.iloc[[df_cats['Postcode'].argmax()]]['Locality'][1267]

'LYNDHURST'

### Loc

The other really important function in Pandas is the loc function. Contrary to iloc, which is an integer based indexing, loc is a "Purely label-location based indexer for selection by label". Since all the rows are ordered from 0 to n, iloc and loc are going to be pretty interchangable in this type of dataset

In [27]:
# select rows 0, 1, 2 --->> EXCLUSIVE
df_cats.iloc[:3]

          Locality  Postcode  ... Colour_Description GENDER
0  DANDENONG NORTH      3175  ...                TAB      F
1  DANDENONG NORTH      3175  ...             BLAWHI      M
2        DANDENONG      3175  ...             TABWHI      F

[3 rows x 6 columns]

In [29]:
# select rows 0, 1, 2, 3 --->> INCLUSIVE
df_cats.loc[:3]

          Locality  Postcode  ... Colour_Description GENDER
0  DANDENONG NORTH      3175  ...                TAB      F
1  DANDENONG NORTH      3175  ...             BLAWHI      M
2        DANDENONG      3175  ...             TABWHI      F
3       SPRINGVALE      3171  ...             TORWHI      F

[4 rows x 6 columns]

Below is an example of how you can use loc to acheive the same task as we did previously with iloc

In [31]:
df_cats.loc[df_cats['Postcode'].argmax(), 'Locality']

'LYNDHURST'

### At

A faster version uses the at() function. At() is really useful wheneever you know the row label and the column label of the particular value that you want to get.

In [32]:
df_cats.at[df_cats['Postcode'].argmax(), 'Locality']

'LYNDHURST'

### NOTE

**iloc looks at position and loc looks at labels**. Loc becomes very important when your row labels aren't integers.

### Select some rows and colums

In [58]:
# select rows from 5 to 8 and columns postcode and locality
df_cats.loc[5:8, ['Postcode', 'Locality']].head()

   Postcode         Locality
5      3175        DANDENONG
6      3175  DANDENONG NORTH
7      3175  DANDENONG NORTH
8      3175  DANDENONG NORTH

## 5. Sorting

Let's say that we want to sort the dataframe in increasing order for the postcode values

In [33]:
# Sorting by value
df_cats.sort_values('Postcode').head()

        Locality  Postcode  ... Colour_Description GENDER
3484  SPRINGVALE      3171  ...             GINGER      M
1799  SPRINGVALE      3171  ...             TABWHI      F
1798  SPRINGVALE      3171  ...             WHIBLA      F
1166  SPRINGVALE      3171  ...             GINWHI      F
1167  SPRINGVALE      3171  ...              BLACK      M

[5 rows x 6 columns]

In [34]:
# sorting by index
df_cats.sort_index(axis=1, ascending=False)

      Postcode         Locality  ... Breed_Description Animal_Type
0         3175  DANDENONG NORTH  ...             DOMSH         Cat
1         3175  DANDENONG NORTH  ...             DOMLH         Cat
2         3175        DANDENONG  ...             DOMSH         Cat
3         3171       SPRINGVALE  ...               DOM         Cat
4         3175        DANDENONG  ...               DOM         Cat
...        ...              ...  ...               ...         ...
3480      3171       SPRINGVALE  ...               RAG         Cat
3481      3174       NOBLE PARK  ...              DOMM         Cat
3482      3174       NOBLE PARK  ...              DOMM         Cat
3483      3171       SPRINGVALE  ...              RAGX         Cat
3484      3171       SPRINGVALE  ...             DOMSH         Cat

[3485 rows x 6 columns]

## 6. Filtering Rows Conditionally

Now, let's say we want to find all of the rows that satisy a particular condition. For example, I want to find all of the rows where cats are black

In [37]:
# Filter black cats
df_cats[df_cats['Colour_Description'] == 'BLACK']

              Locality  Postcode  ... Colour_Description GENDER
9      DANDENONG NORTH      3175  ...              BLACK      F
17    SPRINGVALE SOUTH      3172  ...              BLACK      M
40           DANDENONG      3175  ...              BLACK      F
74          NOBLE PARK      3174  ...              BLACK      F
81         KEYSBOROUGH      3173  ...              BLACK      F
...                ...       ...  ...                ...    ...
3456        NOBLE PARK      3174  ...              BLACK      F
3465        SPRINGVALE      3171  ...              BLACK      F
3467        NOBLE PARK      3174  ...              BLACK      M
3474  SPRINGVALE SOUTH      3172  ...              BLACK      M
3481        NOBLE PARK      3174  ...              BLACK      F

[311 rows x 6 columns]

This also works if you have multiple conditions. Let's say we want to find out all female black cats

In [38]:
df_cats[(df_cats['Colour_Description'] == 'BLACK') & (df_cats['GENDER'] == 'F')]

             Locality  Postcode  ... Colour_Description GENDER
9     DANDENONG NORTH      3175  ...              BLACK      F
40          DANDENONG      3175  ...              BLACK      F
74         NOBLE PARK      3174  ...              BLACK      F
81        KEYSBOROUGH      3173  ...              BLACK      F
97        KEYSBOROUGH      3173  ...              BLACK      F
...               ...       ...  ...                ...    ...
3434        DANDENONG      3175  ...              BLACK      F
3455       NOBLE PARK      3174  ...              BLACK      F
3456       NOBLE PARK      3174  ...              BLACK      F
3465       SPRINGVALE      3171  ...              BLACK      F
3481       NOBLE PARK      3174  ...              BLACK      F

[157 rows x 6 columns]

Another way to filter is using #isin method, where you can select all values inside a list

In [40]:
# filter cats registered in #('NOBLE PARK' 'SPRINGVALE')
df_cats[df_cats["Locality"].isin(["NOBLE PARK", "SPRINGVALE"])]

        Locality  Postcode  ... Colour_Description GENDER
3     SPRINGVALE      3171  ...             TORWHI      F
28    NOBLE PARK      3174  ...             BLAWHI      M
37    NOBLE PARK      3174  ...            BRSPTAB      M
38    NOBLE PARK      3174  ...              BROWN      M
41    NOBLE PARK      3174  ...             WHIBLA      F
...          ...       ...  ...                ...    ...
3480  SPRINGVALE      3171  ...               SEAL      M
3481  NOBLE PARK      3174  ...              BLACK      F
3482  NOBLE PARK      3174  ...             WHIGIN      M
3483  SPRINGVALE      3171  ...              BLUEP      M
3484  SPRINGVALE      3171  ...             GINGER      M

[1070 rows x 6 columns]

## 7. Grouping

By group by we are referring to a process involving one or more of the following steps:

- **Splitting** the data into groups based on some criteria
- **Applying** a function to each group independently
- Combining the results into a data structure

This is a function that allows you to group entries by certain attributes (e.g Grouping entries by Locality) and then perform operations on them.

In [42]:
# grouping by locality and select animal types
df_cats_dogs.groupby('suburb')['type'].value_counts().head()

suburb     type
Addington  Dog       16
           Cat        4
Alfredton  Dog     1302
           Cat      565
Ascot      Dog       15
Name: type, dtype: int64

In [51]:
# groupby multiple
df_cats.groupby(["Locality", "Colour_Description"])['Breed_Description'].value_counts().head(9)

Locality   Colour_Description  Breed_Description
BANGHOLME  BLACK               DOMSH                2
                               DOM                  1
                               DOMLH                1
           BLAGRE              XXXX                 1
           BLATAN              DOMSH                1
           BLAWHI              DOM                  6
                               DOMSH                5
                               DOMLH                1
                               DOMM                 1
Name: Breed_Description, dtype: int64